code-review/NRB_3471_3546/База_Стало/DataProcessors/ЗагрузкаДанныхССайтаЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаДанныхССайтаЦБ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокВалют</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кратность</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаКурса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/ЖурналРегистрацииВызовов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЖурналРегистрацииВызовов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Comment>Длительность в секундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСеанса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаВызова</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидВызова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/DataProcessors/ЗагрузкаДанныхССайтаЦБ/Ext/ObjectModule.bsl
Перем СообщениеПоРезультатуВыполнения Экспорт; // Текст сообщения о результате

Процедура ПроверитьИАктуализироватьКурсы() Экспорт
	
	СообщениеПоРезультатуВыполнения = "";
	Если РаботаСКурсамиВалют.КурсыАктуальны() Тогда
		СообщениеПоРезультатуВыполнения = "Обновление курсов валют не требуется";
		Возврат;
	КонецЕсли;
	
	ОбновитьСписокВалют();
	УстановитьПериодЗагрузки();
	ЗагрузитьКурсыВалют();
	УведомитьОНезагруженныхКурсах();
	
КонецПроцедуры

Процедура ЗагрузитьКурсыВалют() Экспорт
	
	ТаблицаЗагруженныхДанных = РаботаСКурсамиВалют.НоваяТаблицаЗначенийПоКурсамВалют();
	ПолучитьДанныеПоКурсамВалют(НачДата, КонДата, ТаблицаЗагруженныхДанных);
	ЗаписатьСведенияПоКурсамВалют(ТаблицаЗагруженныхДанных);
	
КонецПроцедуры

Процедура ЗаписатьСведенияПоКурсамВалют(ТаблицаЗагруженныхДанных)
	
	Запрос = Новый Запрос(ТекстЗапросаПоКурсамВалютКЗаписи());
	Запрос.УстановитьПараметр("ТаблицаДанных", ТаблицаЗагруженныхДанных);
	Запрос.УстановитьПараметр("СписокВалют", СписокВалют.Выгрузить());
	Запрос.УстановитьПараметр("НачалоПериодаЗагрузки", НачДата);
	Запрос.УстановитьПараметр("КонецПериодаЗагрузки", КонДата);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		СообщениеПоРезультатуВыполнения = "Курсы валют не обновлены";
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписьКурсовВалют = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
		ЗаписьКурсовВалют.Валюта 	= Выборка.Валюта;
		ЗаписьКурсовВалют.Период 	= Выборка.ДатаКурса;
		ЗаписьКурсовВалют.Курс		= Выборка.Курс;
		ЗаписьКурсовВалют.Кратность	= Выборка.Кратность;
		ЗаписьКурсовВалют.Записать();
	КонецЦикла;
	
	СообщениеПоРезультатуВыполнения = "Курсы валют обновлены";
	
КонецПроцедуры

Функция ТекстЗапросаПоКурсамВалютКЗаписи()
	
	Возврат
	"ВЫБРАТЬ
	|	ТаблицаДанных.ДатаКурса КАК ДатаКурса,
	|	ТаблицаДанных.КодВалюты КАК КодВалюты,
	|	ТаблицаДанных.Курс КАК Курс,
	|	ТаблицаДанных.Кратность КАК Кратность
	|ПОМЕСТИТЬ втУстанавливаемыеДанные
	|ИЗ
	|	&ТаблицаДанных КАК ТаблицаДанных
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СписокВалют.Валюта КАК Справочник.Валюты) КАК Валюта,
	|	СписокВалют.ДатаКурса КАК ДатаКурса
	|ПОМЕСТИТЬ втДанныеКОбновлению
	|ИЗ
	|	&СписокВалют КАК СписокВалют
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалют.Период КАК Период,
	|	КурсыВалют.Валюта КАК Валюта
	|ПОМЕСТИТЬ втКурсыБазыДанных
	|ИЗ
	|	втДанныеКОбновлению КАК втДанныеКОбновлению
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ПО втДанныеКОбновлению.Валюта = КурсыВалют.Валюта
	|ГДЕ
	|	КурсыВалют.Период МЕЖДУ &НачалоПериодаЗагрузки И &КонецПериодаЗагрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втУстанавливаемыеДанные.ДатаКурса КАК ДатаКурса,
	|	втУстанавливаемыеДанные.КодВалюты КАК КодВалюты,
	|	втУстанавливаемыеДанные.Курс КАК Курс,
	|	втУстанавливаемыеДанные.Кратность КАК Кратность,
	|	втДанныеКОбновлению.Валюта КАК Валюта
	|ИЗ
	|	втУстанавливаемыеДанные КАК втУстанавливаемыеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ втКурсыБазыДанных КАК втКурсыБазыДанных
	|		ПО втУстанавливаемыеДанные.ДатаКурса = втКурсыБазыДанных.Период
	|			И втУстанавливаемыеДанные.КодВалюты = втКурсыБазыДанных.Валюта.Код
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДанныеКОбновлению КАК втДанныеКОбновлению
	|		ПО втУстанавливаемыеДанные.КодВалюты = втДанныеКОбновлению.Валюта.Код
	|ГДЕ
	|	втКурсыБазыДанных.Период ЕСТЬ NULL";
	
КонецФункции

Процедура ОбновитьСписокВалют() Экспорт
	РаботаСКурсамиВалют.ОбновитьСписокВалют(СписокВалют);
КонецПроцедуры

Процедура УстановитьПериодЗагрузки()
	
	РаботаСКурсамиВалют.УстановитьПериодЗагрузки(СписокВалют, НачДата, КонДата);
	
КонецПроцедуры

Процедура УведомитьОНезагруженныхКурсах()
	
	РаботаСКурсамиВалют.УведомитьОНезагруженныхКурсах(СписокВалют);
	
КонецПроцедуры

Процедура ПолучитьДанныеПоКурсамВалют(НачалоПериодаЗагрузки, ОкончаниеПериодаЗагрузки, ТаблицаДанныхРезультатаСервиса)
	
	НастройкиСоединения = ПараметрыИсточника();
	АдресСервиса = НастройкиСоединения.HTTPСервисАдресРесурса;
	URL = "https://" + НастройкиСоединения.HTTPСервисАдресСервера + "/" + АдресСервиса;
	
	ОписаниеВызова = РегистрыСведений.ЖурналРегистрацииВызовов.НовоеОписаниеВызова(
		"URL = " + URL, "Обработка.ЗагрузкаДанныхССайтаЦБ.ПолучитьДанныеПоКурсамВалют");
	РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьНачало(ОписаниеВызова);
	
	ПроксиСервер = Новый ИнтернетПрокси;
	ПроксиСервер.Установить("https", НастройкиСоединения.ПроксиСерверАдрес, НастройкиСоединения.ПроксиСерверПорт);
	
	МассивОшибок = Новый Массив;
	
	ЗащищенноеСоединение = ?(НастройкиСоединения.HTTPСервисЗащищенноеСоединение, Новый ЗащищенноеСоединениеOpenSSL(), Неопределено);
	
	Попытка
		HTTP = Новый HTTPСоединение(НастройкиСоединения.HTTPСервисАдресСервера, НастройкиСоединения.HTTPСервисПорт, , , ПроксиСервер,
			НастройкиСоединения.HTTPСервисТаймаут, ЗащищенноеСоединение);
	Исключение
		ТекстШаблона = НСтр("ru='Не удалось подключиться к сервису %1. Техническая информация: %2'");
		ТекстОтказа = СтрШаблон(ТекстШаблона, НастройкиСоединения.HTTPСервисАдресСервера, ОписаниеОшибки());
		РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОшибку(ОписаниеВызова, ТекстОтказа);
		Возврат;
	КонецПопытки;
	
	ДатаЗагрузки = НачалоДня(НачалоПериодаЗагрузки);
	
	Пока ДатаЗагрузки <= ОкончаниеПериодаЗагрузки Цикл
		Адрес = СтрШаблон(НастройкиСоединения.HTTPСервисАдресРесурса + "?date_req=%1", Формат(ДатаЗагрузки, "ДФ=dd/MM/yyyy"));
		HTTPЗапрос = Новый HTTPЗапрос(Адрес);
		
		Попытка
			HTTPОтвет = HTTP.Получить(HTTPЗапрос);
			Текст = HTTPОтвет.ПолучитьТелоКакСтроку("windows-1251");
			
			ЧтениеXML = Новый ЧтениеXML;
			ЧтениеXML.УстановитьСтроку(Текст);
			
			ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
			СтруктураКурса = ОбменДаннымиПереопределяемый.СтруктураИзОбъекта(ОбъектXDTO);
			
			ЗаполнитьДанныеПоРезультатуСервисаЦБРФ(ТаблицаДанныхРезультатаСервиса, СтруктураКурса, ДатаЗагрузки);
		Исключение
			Комментарий = "Ошибка за: " + ДатаЗагрузки + ";";
			ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			МассивОшибок.Добавить(Комментарий + ПодробноеПредставлениеОшибки);
		КонецПопытки;
		
		ДатаЗагрузки = ДатаЗагрузки + 24 * 3600;
	КонецЦикла;
	
	Комментарий = "Параметры: Период загрузки: " + НачалоПериодаЗагрузки + " - " + ОкончаниеПериодаЗагрузки;
	Если МассивОшибок.Количество() Тогда
		СообщениеОбОшибках = СтрСоединить(МассивОшибок, "; ");
		РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОшибку(ОписаниеВызова, Комментарий + "; " + СообщениеОбОшибках);
	Иначе
		РегистрыСведений.ЖурналРегистрацииВызовов.ЗафиксироватьОкончание(ОписаниеВызова, Комментарий);
	КонецЕсли;
	
КонецПроцедуры

// Получить параметры источника NSD
// 
// Возвращаемое значение:
//   - Структура - Параметры подключения к источнику NSD
//
Функция ПараметрыИсточника()
	
	Источник = ПланыВидовХарактеристик.ВнешниеИсточники.HTTPСервисCBRDailyInfo;
	Настройка = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(Источник).Настройка;
	
	СтруктураНастроек = Новый Структура;
	
	Если ЗначениеЗаполнено(Настройка) Тогда
		СтруктураНастроек.Вставить("HTTPСервисАдресСервера"								, Настройка.HTTPСервисАдресСервера);
		СтруктураНастроек.Вставить("HTTPСервисПорт"										, Настройка.HTTPСервисПорт);
		СтруктураНастроек.Вставить("HTTPСервисТаймаут"									, Настройка.HTTPСервисТаймаут);
		СтруктураНастроек.Вставить("HTTPСервисЗащищенноеСоединение"						, Настройка.HTTPСервисЗащищенноеСоединение);
		СтруктураНастроек.Вставить("HTTPСервисПользователь"								, Настройка.HTTPСервисПользователь);
		СтруктураНастроек.Вставить("HTTPСервисПароль"									, Настройка.HTTPСервисПароль);
		СтруктураНастроек.Вставить("HTTPСервисАдресРесурсаАутентификации"				, Настройка.HTTPСервисАдресРесурсаАутентификации);
		СтруктураНастроек.Вставить("HTTPСервисАдресРесурса"								, Настройка.HTTPСервисАдресРесурса);
	КонецЕсли;
	
	СтруктураНастроек.Вставить("ПроксиСерверАдрес",			 ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("ПроксиСерверАдрес"));
	СтруктураНастроек.Вставить("ПроксиСерверПорт",			 ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("ПроксиСерверПорт", 3128));
	СтруктураНастроек.Вставить("ПроксиСерверИспользовать",
		ОбщегоНазначенияПовтИсп.ЗначениеГлобальногоПараметра("ПроксиСерверИспользовать", Ложь));
	
	СтруктураНастроек.Вставить("ИмяИсточника",				 Источник.Наименование);
	
	Возврат СтруктураНастроек;
	
КонецФункции

Процедура ЗаполнитьДанныеПоРезультатуСервисаЦБРФ(ТаблицаДанных, СтруктураКурса, ДатаЗагрузки)
	ЭтоРабочийДеньЦБРФ = Истина;
	ПредыдущийДеньЕстьРабочий = ОбщегоНазначения.РабочийДень(ДатаЗагрузки - 1, ЭтоРабочийДеньЦБРФ);
	НеобходимаКорректировкаДатыУстановкиКурсаВыходногоДня = Неопределено;
	
	РезультатСервиса = СтруктураКурса.Valute;
	
	Для Каждого СтрокаРезультата Из РезультатСервиса Цикл
		
		НоваяСтрока = ТаблицаДанных.Добавить();
		НоваяСтрока.ДатаКурса = СтроковыеФункцииКлиентСервер.СтрокаВДату(СтруктураКурса.Date);
		НоваяСтрока.КодВалюты = Формат(Число(СтрокаРезультата.NumCode), "ЧЦ=3; ЧВН=");
		СтрокаРезультата.Value = СтрЗаменить(СтрокаРезультата.Value, ",", ".");
		НоваяСтрока.Курс	  = Число(СтрокаРезультата.Value);
		НоваяСтрока.Кратность = Число(СтрокаРезультата.Nominal);
		
		Если НеобходимаКорректировкаДатыУстановкиКурсаВыходногоДня = Неопределено Тогда
			КурсЦБРФНаВыходнойДень = НЕ ОбщегоНазначения.РабочийДень(НоваяСтрока.ДатаКурса, ЭтоРабочийДеньЦБРФ);
			НеобходимаКорректировкаДатыУстановкиКурсаВыходногоДня = КурсЦБРФНаВыходнойДень И НЕ ПредыдущийДеньЕстьРабочий;
		КонецЕсли;
		Если НеобходимаКорректировкаДатыУстановкиКурсаВыходногоДня Тогда
			НоваяСтрока.ДатаКурса = ДатаЗагрузки;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);
